insert into Position (name, version)
values ('Менеджер', 0),
       ('Инженер', 0),
       ('Бухгалтер0', 0),
       ('Дизайнер', 0);

insert into Citizenship (name, code, version)
values ('Российская федерация', '643', 0),
       ('Португальская Республика', '620', 0),
       ('Республика Польша', '616', 0),
       ('Литовская Республика', '440', 0);

insert into Document_type (name, code, version)
values ('Паспорт РФ', '21', 0),
       ('Свидетельство о рождении', '03', 0),
       ('Военный билет', '07', 0),
       ('Удостоверение беженца', '13', 0);

insert into Organization (name, full_name, inn, kpp, address, phone, is_active, version)
values ('Дом.ru', 'ООО "ДОМ.РУ"', '7709518652', '772501001', 'Россия, Санкт-Петербург, пр-т Финляндский, 4А',
        '79201105080',
        'true', 0),
       ('Ростелеком', 'ООО "Ростелеком"', '7707049388', '784001001', 'Россия, Москва, Сущевский вал 26',
        '79003132704', 'false', 0),
       ('Глобус-Телеком', 'АО "Глобус-Телеком"', '7715227394', '771501001', 'Россия, Москва, ул.Слонова, 1',
        '78452247799', 'true', 0),
       ('Билайн', 'БИЛАЙН (ПАО «ВымпелКом»)', '7713076301', '370202002',
        '127083, Россия, Москва, ул.8-Марта, д.10, стр.14',
        '74932344501', 'true', 0),
       ('Билайн', 'БИЛАЙН-КЛОН', '213076301', '570202004', 'Россия, Саратов, ул.Садовая, д.10',
        '74932344504', 'false', 0);

insert into Office (organization_id, address, phone, is_active, version)
values ('1', 'Саратов, пер. Мирный, 17', '79321234243', 'true', 0),
       ('1', 'Саратов, ТЦ Сказочный Энт/Заводской, пр. Энтузиастов д.24', '79812123134', 'true', 0),
       ('2', 'Саратов, Мирный переулок, 11/13', '79831235467', 'false', 0),
       ('3', 'г. Москва, ул. Образцова, д.38', '78934358965', 'true', 0);

insert into User (office_id, citizenship_id, position_id, first_name, second_name, last_name, phone,
                  is_identified, version)
values ('1', '1', '1', 'Александр', 'Алексеевич', 'Попов', '89271231343', 'true', 0),
       ('1', '2', '1', 'Сергей', 'Николаевич', 'Пашкин', '89122323431', 'true', 0),
       ('2', '3', '2', 'Михаил', 'Иванович', 'Жаворонков', '89232345453', 'true', 0),
       ('3', '1', '1', 'Андрей', 'Романович', 'Шапкарин', '89371233256', 'true', 0);

insert into Document (id, document_type_id, number, date, version)
values ('1', '1', '232455', '2017-10-21', 0),
       ('2', '2', '153256', '2016-9-14', 0),
       ('3', '1', '524235', '2018-5-27', 0),
       ('4', '3', '623462', '2017-7-28', 0);